Repository: UnrealMultiple/TShockPlugin
Catalog: src/EssentialsPlus/i18n/*.po
Languages: es_es

source: -command: 查找命令.
es_es: -command: Buscar comand

source: -f, -force: 强制sudo，忽略权限限制。
es_es: -f, -force: Forzar sudo, ignorando permisos

source: -item: 查找物品.
es_es: Encuentra un artículo.

source: -nosave: 踢出时不保存 SSC 数据.
es_es: -nosave: Patadas sin guardar datos de SSC.

source: -npc: 查找NPC.
es_es: Encuentra un NPC.

source: -r, -repeat: 重复执行时间命令。
es_es: -r, -repeat: Repite el comando de tiempo indefinidamente..

source: -tile: 查找方块.
es_es: Encuentra un mosaico.

source: -wall: 查找墙壁.
es_es: Encuentra una pared.

source: [Essentials+] MySQL已启用，但未设置Essentials+ MySQL配置。
es_es: [Essentials+] MySQL está habilitado, pero la configuración de Essentials+ MySQL tiene no ha sido configurado.

source: [Essentials+] 此插件现在将禁用自身...
es_es: [Essentials+] Este complemento ahora se desactivará solo...

source: [Essentials+] 请在essentials.json中配置您的MySQL服务器信息，然后重新启动服务器。
es_es: [Essentials+] Configure la información de su servidor MySQL en lo esencial.json, luego reinicie el servidor.

source: [EssentialsPlus] 重新加载配置和家!
es_es: [EssentialsPlus] ¡Configuración y Home recargadas!

source: {0} (权限: {1})
es_es: {0} (Permission: {1})

source: {0} 冻结了时间。
es_es: {0} Forzar tiempo.

source: {0} 强制您执行 {1}{2}。
es_es: {0} te obligó a ejecutar {1}{2}.

source: {0} 禁言了 {1}。
es_es: {0} Muteo {1}.

source: {0} 解除了 {1} 的禁言。
es_es: {0} Desmuteo {1}.

source: {0} 解除了时间冻结。
es_es: {0} Desforzar Tiempo.

source: add <名称> [时间] - 禁言玩家或账户。
es_es: add <name> [time] - Mutear cuenta de jugador.

source: del <名称> - 解除禁言玩家或账户。
es_es: del <name> - Desmutear cuenta de jugador.

source: 以自定义颜色广播消息。
es_es: mensaje Broadcast color personalizado.

source: 传送上 {0} 层.
es_es: Teletransportado arriba {0} bloque(s).

source: 传送下 {0} 层.
es_es: Teletransportado abajo {0} bloques(s).

source: 传送到您的一个家点。
es_es: Teletransportarte a tu punto de Home

source: 传送右 {0} 层.
es_es: Teletransportado derecha {0} bloque(s).

source: 传送回 {0} 步.
es_es: Teletransportado atras {0} antes(s)

source: 传送左 {0} 层.
es_es: Teletransportado isquierda {0} bloques(s).

source: 传送您到您的家 '{0}'。
es_es: Teletransportado a tu Home '{0}'.

source: 修改一个方块以设置第一个尺规点。
es_es: Modificar un bloque para establecer el primer punto de la regla.

source: 修改一个方块以设置第二个尺规点。
es_es: Modificar un bloque para establecer el segundo punto de la regla.

source: 允许您以其他用户的身份执行命令。
es_es: Le permite ejecutar un comando como otro usuario.

source: 允许您测量两个方块之间的距离。
es_es: Le permite medir las distancias entre dos bloques..

source: 允许您重复上一条命令。
es_es: Le permite repetir su último comando.

source: 最大化手持物品的堆叠。
es_es: Maximiza la pila de elementos retenidos.

source: 切换冻结时间。
es_es: Alterna congelar el tiempo.

source: 切换您的PvP状态。
es_es: Cambia tu estado PvP.

source: 删除您的一个家点。
es_es: Elimina uno de tus puntos de inicio..

source: 匹配到多个玩家：{0}
es_es: Más de un jugador emparejado: {0}

source: 取消所有时间命令！
es_es: Cancelados todos los comandos de tiempo.!

source: 在PvP中无法使用该命令！
es_es: Este comando está bloqueado en PvP.!

source: 在死亡或传送后将您传送回之前的位置。
es_es: Te teletransporta de regreso a tu posición anterior después de morir o teletransportarte..

source: 在给定时间间隔后执行命令。
es_es: Ejecuta un comando después de un intervalo de tiempo determinado..

source: 填满了您的物品栏。
es_es: Llenó todos tus artículos.

source: 增加了您的{0}的堆叠数量。
es_es: Llena tu {0}.

source: 家的列表: {0}
es_es: Lista de homes/hogares: {0}

source: 尺规未设置！
es_es: Los puntos de la regla no están configurados!

source: 已排队执行命令 '{0}{1}'。使用 /cancel 取消！
es_es: Comando en cola '{0}{1}' indefinidamente. Utilice /cancelar para cancelar!

source: 强制 {0} 执行 {1}{2}。
es_es: Forzado {0} a ejecutar {1}{2}.

source: 您不能禁言 {0}！
es_es: no puedes silenciar {0}!

source: 您已被解除禁言。
es_es: Has sido silenciado.

source: 您已解除禁言。
es_es: Has sido silenciado.

source: 您已达到家的设置上限！
es_es: Has alcanzado el límite de tu casa!

source: 您无法强制 {0} 执行 {1}{2}！
es_es: no puedes forzar {0} a ejecutar {1}{2}!

source: 您没有上次的命令！
es_es: No tienes un último comando!

source: 您没有设置家。
es_es: No tienes casas establecidas.

source: 您没有访问 '-{0}' 参数的权限！
es_es: No tienes acceso al interruptor. '-{0}'!

source: 您的{0}已经满了。
es_es: Tu {0} Esta lleno.

source: 您的物品栏已经满了。
es_es: Tu inventario esta lleno.

source: 成功删除您的家 '{0}'。
es_es: Home borrado '{0}'.

source: 成功踢出所有人。原因: '{0}'。
es_es: Todos han sido expulsados por '{0}'.

source: 找到的NPC ({0}/{1}):
es_es: NPC encontrados: ({0}/{1}):

source: 找到的命令 ({0}/{1}):
es_es: Comandos encontrados: ({0}/{1}):

source: 找到的墙壁 ({0}/{1}):
es_es: Paredes encontradas: ({0}/{1}):

source: 找到的方块 ({0}/{1}):
es_es: Mosaicos encontrados: ({0}/{1}):

source: 找到的物品 ({0}/{1}):
es_es: Items encontrados: ({0}/{1}):

source: 无效的存储类型！
es_es: Tipo de almacenamiento no válido!

source: 无效的家 '{0}'！
es_es: Hogar invalido '{0}'!

source: 无效的层数 '{0}'！
es_es: Número de niveles no válido '{0}'!

source: 无效的时间 '{0}'!
es_es: Hora no válida '{0}'!

source: 无效的时间 '{0}'！
es_es: Hora no válida '{0}'!

source: 无效的步数 '{0}'！
es_es: Número de pasos no válido '{0}'!

source: 无效的玩家 '{0}'！
es_es: Jugador invalido '{0}'!

source: 无效的玩家或账户 '{0}'！
es_es: Jugador o cuenta invalida '{0}'!

source: 无效的语法！正确的语法是：{0}down [层数]
es_es: ¡Sintaxis no válida! Sintaxis correcta: {0}down [levels]

source: 无效的语法！正确的语法是：{0}eback [步数]
es_es: ¡Sintaxis no válida! Sintaxis adecuada: {0}eback [steps]

source: 无效的语法！正确的语法是：{0}left [层数]
es_es: ¡Sintaxis no válida! Sintaxis correcta: {0}left [levels]

source: 无效的语法！正确的语法是：{0}right [层数]
es_es: ¡Sintaxis no válida! Sintaxis correcta: {0}right [levels]

source: 无效的语法！正确的语法是：{0}ruler [1/2]
es_es: ¡Sintaxis no válida! Sintaxis correcta: {0}ruler [1/2]

source: 无效的语法！正确的语法是：{0}send [r,g,b] <文本...>
es_es: ¡Sintaxis no válida! Sintaxis correcta: {0}send [r,g,b] <text...>

source: 无效的语法！正确的语法是：{0}sudo [-switches...] <玩家> <命令...>
es_es: ¡Sintaxis no válida! Sintaxis correcta: {0}sudo [-switches...] <player> <command...>

source: 无效的语法！正确的语法是：{0}timecmd [-switches...] <时间> <命令...>
es_es: ¡Sintaxis no válida! Sintaxis correcta: {0}timecmd [-switches...] <time> <command...>

source: 无效的语法！正确的语法是：{0}up [层数]
es_es: ¡Sintaxis no válida! Sintaxis correcta: {0}up [levels]

source: 无效的语法！正确的语法是：/mute add <名称> [时间]
es_es: ¡Sintaxis no válida! Sintaxis correcta: /mute add <name> [time]

source: 无效的语法！正确的语法是：/mute del <名称>
es_es: ¡Sintaxis no válida! Sintaxis correcta: /mute del <name>

source: 无效的页数 '{0}'！
es_es: Pagina invalida '{0}'!

source: 无效的颜色！
es_es: color invalido!

source: 无法传送上面！
es_es: No se pudo teletransportar!

source: 无法传送下去！
es_es: No se pudo teletransportar hacia abajo!

source: 无法传送右边！
es_es: No se pudo teletransportar bien!

source: 无法传送回上一个位置！
es_es: No se pudo teletransportar de regreso!

source: 无法传送左边！
es_es: No se pudo teletransportar a la izquierda!

source: 无法删除家，请检查日志获取更多详细信息。
es_es: No se pudo eliminar la casa; consulte los registros para obtener más detalles.

source: 无法更新家，请检查日志获取更多详细信息。
es_es: No se pudo actualizar la página de inicio. Consulte los registros para obtener más detalles..

source: 无法禁言，请查看日志获取更多信息。
es_es: No se pudo silenciar; consulte los registros para obtener más detalles..

source: 无法解除禁言，请查看日志获取更多信息。
es_es: No se pudo reactivar el sonido. Consulte los registros para obtener más detalles..

source: 无法设置家，请检查日志获取更多详细信息。
es_es: No se pudo configurar el inicio. Consulte los registros para obtener más detalles.

source: 更新了您的家 '{0}'。
es_es: Hogar actualizado '{0}'.

source: 有效的 {0}find 参数:
es_es: Valid {0}find switches:

source: 有效的 {0}find 参数：
es_es: Valid {0}find switches:

source: 有效的 {0}kickall 参数:
es_es: Valid {0}kickall switches:

source: 有效的 {0}sudo 参数：
es_es: Valid {0}sudo switches:

source: 有效的 {0}timecmd 参数:
es_es: Valid {0}timecmd switches:

source: 未找到NPC。
es_es: No se encontraron NPC.

source: 未找到命令。
es_es: No se encontraron comandos.

source: 未找到墙壁。
es_es: No se encontraron paredes.

source: 未找到方块。
es_es: No se encontraron mosaicos.

source: 未找到物品。
es_es: No se encontraron artículos.

source: 查找具有指定名称的物品和/或NPC。
es_es: Encuentra un elemento y/o NPC con el nombre especificado.

source: 格式错误！正确的语法是：{0}find <-参数> <名称...> [页数]
es_es: ¡Sintaxis no válida! Sintaxis adecuada: {0}find <-switch> <name...> [page]

source: 没有原因。
es_es: No reason.

source: 禁言子命令:
es_es: Mute Sub-Commandos:

source: 管理禁言。
es_es: Gestiona mutes.

source: 设置了您的家 '{0}'。
es_es: Establecer hogar '{0}'.

source: 设置您的一个家点。
es_es: Te establece un punto de hogar.

source: 语法错误！正确的语法是：{0}delhome <家的名称>
es_es: ¡Sintaxis no válida! Sintaxis adecuada: {0}delhome <home name>

source: 语法错误！正确的语法是：{0}myhome <家的名称>
es_es: ¡Sintaxis no válida! Sintaxis adecuada: {0}myhome <home name>

source: 语法错误！正确的语法是：{0}sethome <家的名称>
es_es: ¡Sintaxis no válida! Sintaxis adecuada: {0}sethome <home name>

source: 距离：X轴：{0}，Y轴：{1}，直角距离：{2:N3}
es_es: Distancia: X: {0}, Y: {1}, Cartesiano: {2:N3}

source: 踢出原因:
es_es: Expulsado:

source: 踢出服务器上的所有人。
es_es: Expulsar a todos de tu server.

source: 输入 /find -command {0} {{0}} 查看更多
es_es: Type /find -command {0} {{0}} Para mas

source: 输入 /find -item {0} {{0}} 查看更多
es_es: Type /find -item {0} {{0}} Para mas

source: 输入 /find -npc {0} {{0}} 查看更多
es_es: Type /find -npc {0} {{0}} Para mas

source: 输入 /find -tile {0} {{0}} 查看更多
es_es: Type /find -tile {0} {{0}} Para mas

source: 输入 /find -wall {0} {{0}} 查看更多
es_es: Type /find -wall {0} {{0}} Para mas

source: 通过一个方块层向上传送您。
es_es: Te teletransporta a través de una capa de bloques.

source: 通过一个方块层向下传送您。
es_es: Te teletransporta a través de una capa de bloques.

source: 通过一个方块层向右传送您。
es_es: Te teletransporta a través de una capa de bloques.

source: 通过一个方块层向左传送您。
es_es: Te teletransporta a través de una capa de bloques.

source: 重复执行上次的命令 '{0}{1}'！
es_es: Repetir el ultimo comando '{0}{1}'!
