Repository: UnrealMultiple/TShockPlugin
Catalog: src/AutoPluginManager/i18n/*.po
Languages: es_es

source: [AutoUpdate]无法获取更新:
es_es: [AutoUpdate] No se pueden obtener actualizaciones:

source: [AutoUpdatePlugin]插件配置已重载~
es_es: [AutoUpdatePlugin] Plugin configuration has been reloaded~

source: [以下插件有新的版本更新]
es_es: [The following Estos plugins tienen nueva version disponible

source: [外部库安装完成]
es_es: [External [Instalacion de Librerias completada]]

source: [安装完成]
es_es: [Instalacion completada]

source: [插件重复安装]
es_es: [Instalacion de plugin duplicado]

source: [更新完成]
es_es: [Actualizacion completada]

source: *使用/apm -i <序号> 即可安装哦~
es_es: *Utilice /apm -i <número> para instalar~

source: *加载失败: {0}
es_es: *Error al cargar: {0}

source: *卸载失败: {0}
es_es: *Falló la desinstalación: {0}

source: *热加载失败的插件需要重启服务器后才会生效!
es_es: *¡Los complementos que no se pueden cargar en caliente solo tendrán efecto después de que se reinicie el servidor!

source: *热重载已关闭,插件需要重启服务器后才会生效!
es_es: * ¡La recarga en caliente está desactivada y el complemento entrará en vigor después de que se reinicie el servidor!

source: *热重载已启用,安装的插件已生效!
es_es: *¡La recarga en caliente está habilitada y los complementos instalados han entrado en vigor!

source: apm b [插件名字] 更新时跳过指定插件
es_es: apm b [nombre del complemento] omite el complemento especificado al actualizar

source: apm c 检测已安装插件更新
es_es: apm c detecta actualizaciones de complementos instalados

source: apm i [序号] 安装指定插件
es_es: apm i [número de serie] instala el complemento especificado

source: apm l 查看可安装插件表
es_es: apm l Ver la lista de complementos instalables

source: apm lb 查看更新排除列表
es_es: apm lb Ver lista de exclusión de actualizaciones

source: apm rb [插件名字] 取消更新排除
es_es: apm rb [nombre del complemento] cancelar exclusión de actualización

source: apm u [插件名] 更新所有插件或指定插件
es_es: apm u [nombre del complemento] Actualiza todos los complementos o dependencias especificados

source: 你可以使用命令/apm -u 更新插件哦~
es_es: Puedes usar el comando /apm -u para actualizar los complementos~

source: 你的插件全是最新版本，无需更新哦~
es_es: Todos sus complementos están actualizados, no es necesario actualizarlos ~

source: 删除失败, 没有在你的插件列表里找到这个插件呢~
es_es: La eliminación falló, el complemento no se encontró en su lista de complementos~

source: 删除成功, 此插件将会被检查更新~
es_es: Eliminación exitosa, ahora se verificará si hay actualizaciones de este complemento~

source: 可安装插件列表:
es_es: Lista de complementos instalables:

source: 安装了个寂寞~
es_es: No se ha instalado nada~

source: 安装插件出现错误:
es_es: Se produjo un error al instalar el complemento:

source: 序号无效，请附带需要安装插件的选择项!
es_es: Número no válido, incluya las opciones requeridas para instalar el complemento.

source: 当前没有排除任何一个插件哦~
es_es: Actualmente, no se ha excluido ningún complemento ~

source: 排除失败, 已经排除过这个插件了呢~
es_es: La exclusión falló, el complemento se excluyó anteriormente~

source: 排除失败, 没有在你的插件列表里找到这个插件呢~
es_es: La exclusión falló, el complemento no se encontró en su lista de complementos~

source: 排除成功, 已跳过此插件的更新检查~
es_es: Exclusión exitosa, se omitió la verificación de actualización de este complemento~

source: 插件更新排除列表:
es_es: Lista de exclusión de actualización de complementos:

source: 无效参数，请附带需要安装插件的选择项!
es_es: Parámetro no válido. Incluya las opciones requeridas para instalar el complemento.

source: 无法获取更新:
es_es: No se puede obtener la actualización:

source: 更新了个寂寞~
es_es: No actualizado nada~

source: 正在自动更新插件...
es_es: Actualizando complementos automáticamente...

source: 自动更新出现错误:
es_es: Se produjo un error durante la actualización automática:
