Repository: UnrealMultiple/TShockPlugin
Catalog: src/DamageRuleLoot/i18n/*.po
Languages: ru_ru

source: [i:3455][c/AD89D5:伤][c/D68ACA:害][c/DF909A:排][c/E5A894:行][c/E5BE94:榜][i:3454]
ru_ru: [i:3455][c/AD89D5:Таб][c/D68ACA:лица] [c/DF909A:Лиде][c/E5A894:ров] [c/E5BE94:По] [c/F08869:Уро][c/FE624F:ну][i:3454]

source: 伤害:[c/74F3C9:{0}]
ru_ru: Урон: [c/74F3C9:{0}]

source: 暴击:[c/74F3C9:{0}]
ru_ru: Крит ударов: [c/74F3C9:{0}]

source: 比例:[c/74F3C9:{0:0.00%}]
ru_ru: Отношение по урону: [c/74F3C9:{0:0.00%}]

source: 当前服务器有 [c/74F3C9:{0}位] 玩家 | 未参战: [c/A7DDF0:{1}位]
ru_ru: Игроков на сервере: [c/74F3C9:{0}] | НЕ было в битве: [c/A7DDF0:{1}]

source: 恭喜以下 [c/74F3C9:{0}位] 玩家击败了 [c/F7686D:{1}]
ru_ru: Поздравления [c/74F3C9:{0}] игрокам, победившие - [c/F7686D:{1}]

source: [c/F06576:【停转】] 玩家:[c/F06576:{0}]
ru_ru: [c/F06576:【Рубеж】] Игрок: [c/F06576:{0}]

source: [c/F06576:【注意】]输出少于 [c/A7DDF0:{0:0.00%}] 禁止掉落宝藏袋:
ru_ru: [c/F06576:【Внимание!】] Нанесённый вами урон в [c/A7DDF0:{0:0.00%}] даёт вам оставаться без приза:

source: [c/FBF069:【暴击】] 玩家:[c/F06576:{0}]
ru_ru: [c/FBF069:【Крит】] Игрок: [c/F06576:{0}]

source: [c/FBF069:【转伤】] 玩家:[c/F06576:{0}]
ru_ru: [c/FBF069:【Передача урона】] Игрок: [c/F06576:{0}]

source: [c/FBF069:【转移】] 玩家:[c/F06576:{0}]
ru_ru: [c/FBF069:【Передача】] Игрок: [c/F06576:{0}]

source: [伤害规则掉落]重新加载配置完毕。
ru_ru: [DamageRuleLoot] Успешное чтение конфигурации

source: 双子魔眼
ru_ru: Близнецы

source: 对象:[c/AEA3E4:{0}] 满血:[c/FBF069:{1}]
ru_ru: Цель: [c/AEA3E4:{0}] Полный HP: [c/FBF069:{1}]

source: 攻击对象:[c/AEA3E4:{0}] |
ru_ru: Цель: [c/AEA3E4:{0}] |

source: 暴击数:[c/FBF069:{0}]
ru_ru: Кол-во критов: [c/FBF069:{0}]

source: 月亮领主
ru_ru: Лунный Лорд

source: 根据输出排名榜决定是否掉落宝藏袋的惩罚，并对各个BOSS进行相对的伤害规则处理
ru_ru: Позволяет отображать нанесённый урон по NPC, настраивать получение сокровищ, таблица лидеров

source: 火星飞碟
ru_ru: Тарелка Марсиан

source: 猪龙鱼公爵
ru_ru: Герцог Рыброн

source: 生命:[c/FBF069:{0}]
ru_ru: Здоровье: [c/FBF069:{0}]

source: 美杜莎
ru_ru: Мехдуза

source: 血肉墙
ru_ru: Стена Плоти

source: 血量:[c/6DDA6D:{0}] 伤害:[c/F06576:{1}]
ru_ru: Остаточный HP: [c/6DDA6D:{0}] Урон: [c/F06576:{1}]

source: 转伤对象:[c/AEA3E4:{0}] | 生命值:[c/6DDA6D:{1}] <
ru_ru: Цель: [c/AEA3E4:{0}], передача урона от убитых прислужников отключена! | HP: [c/6DDA6D:{1}] <

source: 转移:[c/6DDA6D:{0}] 伤害:[c/F06576:{1}]
ru_ru: Передача: [c/6DDA6D:{0}] Урон: [c/F06576:{1}]
