Repository: UnrealMultiple/TShockPlugin
Catalog: src/Challenger/i18n/*.po
Languages: es_es

source: [c/95CFA6:<挑战者:挖矿套>] 背包已满，还需空位：[c/95CFA6:{0}] 以放入 [c/95CFA6:{1}] .
es_es: [c/95CFA6:<Challenger: conjunto de minería>]El inventario está lleno, necesitas un espacio adicional: [c/95CFA6:{0}] ta ella le gusta [c/95CFA6:{1}].

source: [c/95CFA6:<挑战者:挖矿套>] 连锁挖掘了 [c/95CFA6: {0} {1}].
es_es: [c/95CFA6:<Challenger: conjunto de minería>] Cadena minada[c/95CFA6: {0} {1}].

source: [挑战者模式]重新加载配置完毕。
es_es: [Challenger] Configuración recargada exitosamente.

source: {0} 发动了混乱之脑迷惑，成功迷惑了附近 {1}个敌人
es_es: {0} activó el Cerebro de la Confusión, confundiendo con éxito a {1} enemigos cercanos.

source: {0} 收听了 {1} 世界先知广播：{2}有流星
es_es: {0} escuchó la transmisión de World Prophet desde {1}: Habrá una lluvia de meteoritos en {2}.

source: {0} 收听了 {1} 世界先知广播：{2}满月
es_es: {0} escuchó la transmisión de World Prophet desde {1}: Hay luna llena a las {2}.

source: {0} 收听了 {1} 世界先知广播：{2}灯笼夜
es_es: {0} escuchó la transmisión de World Prophet desde {1}: Es la Noche de los Linternas a las {2}.

source: {0} 收听了 {1} 世界先知广播：{2}血月
es_es: {0} escuchó la transmisión del Profeta Mundial desde {1}: Es una luna de sangre en {2}.

source: {0} 收听了 {1} 世界先知广播：明天日食
es_es: {0} escuchó la transmisión de World Prophet desde {1}: Mañana habrá un eclipse solar.

source: {0} 收听了 {1} 天气预报收音广播：不会下雨
es_es: {0} escuchó la transmisión del pronóstico del tiempo desde {1}: No lloverá.

source: {0} 收听了 {1} 天气预报收音广播：不会有沙尘暴
es_es: {0} escuchó {1} radio del pronóstico del tiempo: no habrá tormenta de arena

source: {0} 收听了 {1} 天气预报收音广播：不会有风
es_es: {0} escuchó la transmisión del pronóstico del tiempo desde {1}: No habrá viento.

source: {0} 收听了 {1} 天气预报收音广播：即将下雨
es_es: {0} escuchó la transmisión del pronóstico del tiempo desde {1}: Pronto lloverá.

source: {0} 收听了 {1} 天气预报收音广播：即将刮起沙尘暴
es_es: {0} escuchó la transmisión del pronóstico del tiempo desde {1}: Pronto se avecina una tormenta de arena.

source: {0} 收听了 {1} 天气预报收音广播：即将挂起狂风
es_es: {0} escuchó la transmisión del pronóstico del tiempo desde {1}: Pronto llegarán vientos huracanados.

source: {0} 收听了 {1} 天气预报收音广播：即将挂起风
es_es: {0} escuchó la transmisión del pronóstico del tiempo desde {1}: El viento llegará pronto.

source: {0} 收听了 {1} 天气预报收音广播：顺其自然，不会发生任何事件
es_es: {0} escuchó la transmisión del pronóstico del tiempo desde {1}: Todo estará en calma; no ocurrirán eventos.

source: 【丛林套装】 挑战模式奖励：间歇地从玩家周围生成伤害性的孢子
es_es: [Conjunto de selva] Recompensa del modo Desafío: genera periódicamente esporas dañinas alrededor del jugador.

source: 【克苏鲁之盾】 挑战模式奖励：冲刺时获得一小段无敌时间，冷却 {0}秒
es_es: [Escudo de Cthulhu] Recompensa del modo Desafío: Otorga un breve período de invencibilidad mientras corres, tiempo de reutilización: {0} segundos

source: 【分趾袜】 挑战模式奖励：冲刺时获得一小段无敌时间，冷却 {0}秒
es_es: [Calcetines con punta abierta] Recompensa del modo Desafío: Otorga un breve período de invencibilidad mientras corres, tiempo de reutilización: {0} segundos

source: 【化石套装】 挑战模式奖励：在头上召唤一个琥珀光球，向敌人 抛出极快的闪电矢
es_es: [Conjunto de fósiles] Recompensa del modo Desafío: invoca una luz ámbar esfera sobre el jugador que dispara extremadamente rápido relámpagos a los enemigos.

source: 【叶绿套装】 挑战模式奖励：释放不精确的叶绿水晶矢，丛林之 力给你更高的生命上限
es_es: [Conjunto de hoja verde] Recompensa del modo Desafío: Lanzamientos imprecisos flechas de cristal de color verde hoja; Poder de la jungla aumenta tu salud máxima.

source: 【垂钓套装】 挑战模式奖励：给予永久的声纳、钓鱼、宝匣、镇 定Buff
es_es: [Juego de pesca] Recompensa del modo Desafío: otorga sonar permanente, pesca, cofre del tesoro y aficionados tranquilos.

source: 【寒霜套装】 挑战模式奖励：你周围开始下雪
es_es: [Configuración de escarcha] Recompensa del modo Desafío: comienza a nevar a tu alrededor.

source: 【幽魂套装】 挑战模式奖励：根据头饰选择增加40血上限或80魔 力上限；召唤 2个幽魂诅咒环绕玩家，向附近敌人攻击
es_es: [Conjunto fantasma] Recompensa del modo Desafío: aumenta la salud máxima por 40 o maná máximo por 80 según el casco elección; invoca 2 anillos de maldición fantasmales alrededor del jugador que ataca a los enemigos cercanos.

source: 【忍者大师装备】 挑战模式奖励：冲刺时获得一小段无敌时间，冷却 {0}秒
es_es: [Equipo maestro ninja] Recompensa del modo Desafío: Otorga un breve período de invencibilidad mientras corres, tiempo de reutilización: {0} segundos.

source: 【忍者套装】 挑战模式奖励：有四分之一概率闪避非致命伤害并 释放烟雾
es_es: [Conjunto Ninja] Recompensa del modo Desafío: 25% de probabilidad de esquivar daños no letales y liberación de humo.

source: 【挖矿套装】 挑战模式奖励：给予永久的挖矿、糖果冲刺Buff 启用连锁挖矿能力
es_es: [Conjunto de minería] Recompensa del modo Desafío: Otorga minería permanente y aficionados a las carreras de velocidad dulces; permite la capacidad de minería en cadena.

source: 【挥发明胶】 挑战模式奖励：击中敌人有概率掉落碎魔晶，珍珠 石，凝胶等
es_es: [Gel volátil] Recompensa del modo Desafío: los enemigos golpeados tienen una oportunidad para dejar caer cristales mágicos rotos, perlas, gel, etc.

source: 【提基套装】 挑战模式奖励：增加20血上限，在鞭子的轨迹上留 下孢子
es_es: [Conjunto Tiki] Recompensa del modo Desafío: aumenta la salud máxima por 20; deja esporas en el rastro del látigo.

source: 【收音机零件】 挑战模式奖励：输入“/cf”收听天气预报，在困难 模式中可以收听世界先知预报
es_es: [Partes de radio] Recompensa del modo Desafío: ingresa “/cf” para escuchar pronósticos meteorológicos; También puedo escuchar World Prophet. pronósticos en modo difícil.

source: 【暗影套装】 挑战模式奖励：暴击时从玩家周围生成吞噬怪飞弹 攻击周围敌人，冷却 1秒
es_es: [Conjunto de sombras] Recompensa del modo Desafío: Genera monstruo devorador misiles alrededor del jugador en caso de impactos críticos; ataques cercanos enemigos, tiempo de reutilización: 1 segundo.

source: 【死灵套装】 挑战模式奖励：受到伤害时，向四周飞溅骨头；攻 击时偶尔发射骨箭
es_es: [Conjunto de nigromante] Recompensa del modo Desafío: salpica huesos al recibir daño; ocasionalmente dispara hueso flechas al atacar.

source: 【水晶刺客套装】 挑战模式奖励：当有敌人在附近时，自身释放出水 晶碎片；若玩家被击中，释放出更强大的碎片
es_es: [Conjunto de asesino de cristal] Recompensa del modo Desafío: libera fragmentos de cristal cuando hay enemigos cerca; libera fragmentos más fuertes si el jugador es golpeado.

source: 【海龟套装】 挑战模式奖励：增加60血上限，自动在附近释放爆 炸碎片
es_es: [Conjunto de tortugas] Recompensa del modo Desafío: aumenta la salud máxima por 60; Libera automáticamente fragmentos explosivos cercanos.

source: 【混乱之脑】 挑战模式奖励：输入“/cf”混乱周围所有敌怪
es_es: [Cerebro de confusión] Recompensa del modo Desafío: ingresa "/cf" en confundir a todos los enemigos cercanos.

source: 【狱炎套装】 挑战模式奖励：免疫岩浆，给予永久的地狱火增益
es_es: [Conjunto infierno] Recompensa del modo Desafío: inmune a la lava; otorga un beneficio permanente de Hellfire.

source: 【猩红套装】 挑战模式奖励：暴击时从周围每个敌怪处吸取一定 血量随着敌怪数目增多吸血量-1，冷却 5秒
es_es: [Conjunto carmesí] Recompensa del modo Desafío: Absorbe una cierta cantidad de salud de cada enemigo en golpes críticos; La cantidad de salud absorbida disminuye en 1 a medida que el número de Los enemigos aumentan, tiempo de reutilización: 5 segundos.

source: 【甲虫套装】 挑战模式奖励：增加60血上限，敌人的伤害的一部 分会治疗周围的队友并给予buff；当装备帕拉丁盾 或其上级合成物时，帕拉丁之锤伤害翻倍
es_es: [Armadura de escarabajo] Recompensa del modo Desafío: aumenta el límite de salud en 60, parte del daño enemigo cura a los compañeros de equipo cercanos y otorga beneficios; El daño del Martillo del Paladín se duplica cuando está equipado con el Escudo de Paladín o su variante de nivel superior.

source: 【皇家凝胶】 挑战模式奖励：天空开始下凝胶小雨
es_es: [Gel real] Recompensa del modo Desafío: una ligera lluvia de gel cae del cielo.

source: 【神圣套装】 挑战模式奖励：击中敌人时召唤光与暗剑气，输入 “/cf”切换剑气类型
es_es: [Armadura sagrada] Recompensa del modo Desafío: invoca luz y oscuridad ondas de espada al golpear a los enemigos. Escribe '/cf' para cambiar entre tipos de ondas de espada.

source: 【禁戒套装】 挑战模式奖励：释放自动寻的灵焰魂火攻击附近的 敌人
es_es: [Armadura prohibida] Recompensa del modo Desafío: Libera llamas espirituales rastreadoras. para atacar a los enemigos cercanos.

source: 【箭袋】 挑战模式奖励：无限补充弹药，额外获得BUFF
es_es: [Carcaj] Recompensa del modo Desafío: reposición infinita de munición y ventajas adicionales.

source: 【蘑菇套装】 挑战模式奖励：射弹会不稳定地留下蘑菇
es_es: [Armadura de hongo] Recompensa del modo Desafío: los proyectiles salen Hongos inestables detrás.

source: 【蜘蛛套装】 挑战模式奖励：攻击时，给予敌人中毒和剧毒减益 ，按“up”键生成一个毒牙药水瓶，砸中敌人时爆炸
es_es: [Armadura de araña] Recompensa del modo Desafío: inflige veneno y desventajas de veneno. sobre los enemigos al atacar. Presiona "arriba" para crear una poción de colmillo venenoso, que explota al impactar.

source: 【蜜蜂套装】 挑战模式奖励：给予永久的蜂蜜增益；不间断地向 四周撒蜂糖罐，玩家接触后回血并给予15秒蜂蜜增 益；对玩家自身的治疗量略低于对其他玩家
es_es: [Armadura de abeja] Recompensa del modo Desafío: Otorga un beneficio de miel permanente; Esparce constantemente tarros de miel que curan a los jugadores al contacto. y proporciona un beneficio de miel de 15 segundos; La curación para el jugador es un poco menos efectiva en comparación con otras.

source: 【蜜蜂背包】 挑战模式奖励：不间断地向四周扔出毒蜂罐，爆炸 后释放一只蜜蜂
es_es: [Paquete de abejas] Recompensa del modo Desafío: Lanza continuamente frascos de abejas envenenadas, liberando una abeja al explotar.

source: 【蠕虫围巾】 挑战模式奖励：免疫寒冷，霜火，灵液和咒火
es_es: [Bufanda de gusano] Recompensa del modo Desafío: inmunidad al frío, fuego helado, llamas malditas e icor.

source: 【阴森套装】 挑战模式奖励：使用鞭子时，甩出蝙蝠或南 瓜头
es_es: [Conjunto siniestro] Recompensa del modo Desafío: al usar un látigo, los murciélagos o se tiran cabezas de calabaza.

source: 【陨石套装】 挑战模式奖励：暴击时恢复些许魔力，间歇地降下 高伤害落星攻击敌人
es_es: [Conjunto de meteoritos] Recompensa del modo Desafío: Restaura una pequeña cantidad de maná en golpes críticos e invoca intermitentemente un gran daño estrellas fugaces para atacar a los enemigos.

source: 【黑曜石套装】 挑战模式奖励：因为盗贼的祝福，掉落物会尝试掉落两次 (仅对非boss生物和非高血量怪物有效)
es_es: [Conjunto de obsidiana] Recompensa del modo Desafío: debido a la bendición del ladrón, El botín intentará caer dos veces. (solo efectivo en criaturas que no son jefes y monstruos que no tienen mucha salud).

source: Challenger.OnServerLeave异常3：
es_es: Challenger.OnServerLeave Excepción 3:

source: CrystalLeafShot -> MyEffect 异常：{0}
es_es: CrystalLeafShot -> Excepción de MyEffect:{0}

source: 不许抢我的蜂蜜
es_es: No tomes mi miel.

source: 世界已关闭挑战模式，快乐游玩吧
es_es: El mundo ha cerrado el modo desafío, diviértete jugando.

source: 世界已开启挑战模式，祝您好运！
es_es: El mundo ha entrado en modo Pesadilla, ¡buena suerte!

source: 付出代价吧！
es_es: ¡Paga el precio!

source: 代码异常4：{0}
es_es: Excepción de código 4: {0}

source: 你将受到灭顶之灾
es_es: Serás aniquilado

source: 你感觉寒冷刺骨
es_es: Sientes mucho frio

source: 你打痛我右手了！！！
es_es: ¡¡¡Me lastimaste la mano derecha!!!

source: 你打痛我左手了！！！
es_es: ¡¡¡Me lastimaste la mano izquierda!!!

source: 你找到那颗子弹了吗
es_es: ¿Encontraste la bala?

source: 你真的能分清真假血弹吗
es_es: ¿Puedes realmente distinguir entre balas de sangre reales y falsas?

source: 你被 {0} 治疗了 {1} 点生命值
es_es: Fuiste curado por {0} por {1} puntos de vida

source: 再让我逮到一下你就玩玩
es_es: Si te vuelvo a atrapar, estás condenado.

source: 冰雪从天而降
es_es: La nieve y el hielo caen del cielo.

source: 冲刺类饰品冷却完成
es_es: Enfriamiento de accesorios de sprint completado

source: 创死你
es_es: ¡Te aplastaré!

source: 刺啦
es_es: SIZZLE XD!

source: 史莱姆王习得冰魔法归来
es_es: King Slime aprende magia de hielo y regresa.

source: 史莱姆王发怒了
es_es: El rey Slime está enojado.

source: 吱嗡
es_es: ZUMBIDO

source: 呜哇哇
es_es: WOO WOW WOW

source: 咬碎你
es_es: ¡Te voy a morder en pedazos!

source: 哇哇嗷
es_es: WOW WOW

source: 嗡嗡
es_es: ZUMBIDOOOOO

source: 嗡嗡嗡嗡
es_es: ZUMBIDOOOOOOOOOOOOOOOO

source: 嗷嗷
es_es: AWW

source: 嘎吱作响
es_es: CRUNCHING

source: 增强游戏难度，更好的游戏体验
es_es: Aumenta la dificultad del juego para una mejor experiencia de juego.

source: 寒风呼啸
es_es: viento aullante

source: 小心我爆炸的鳞甲
es_es: Cuidado con mis escamas explosivas

source: 小辣鸡
es_es: ¡Perdedor!

source: 就这就这！
es_es: ¿Eso es todo?

source: 就这还想打倒我骷髅王爷爷
es_es: ¿Quieres acabar con el abuelo Skeletron? ¡En tus sueños!

source: 怒不可遏
es_es: Estoy absolutamente furioso!

source: 惨朽不堪
es_es: ¡Patético!

source: 想再贴贴吗？
es_es: ¿Quieres volver a sentirte cómodo?

source: 拆掉拆掉！
es_es: ¡Derribalo! ¡Derribalo!

source: 挑战模式启用，祝您愉快。[操作来自：{0}]
es_es: Modo desafío activado. ¡Divertirse! [Acción de: {0}]

source: 挑战模式已关闭，无法开启文字提示
es_es: Modo desafío desactivado. Las sugerencias de texto no se pueden habilitar.

source: 挑战模式已取消，您觉得太难了？[操作来自：{0}]
es_es: Modo desafío cancelado. ¿Crees que eres demasiado bueno para esto? [Acción de: {0}]

source: 敌怪治疗 + {0}
es_es: Curación del enemigo + {0}

source: 文字提示已取消
es_es: Sugerencias de texto deshabilitadas.

source: 文字提示已启用
es_es: Sugerencias de texto habilitadas.

source: 有毒的鳞甲炸裂开来
es_es: ¡Las escamas venenosas explotan!

source: 未启用挑战模式！
es_es: ¡Modo Desafío no activado!

source: 毒刺射你一脸
es_es: ¡Espinas venenosas te disparan a la cara!

source: 毒牙咬击
es_es: ¡Mordedura de colmillo venenoso!

source: 永夜剑辉已启用
es_es: ¡Eternal Night Blade activado!

source: 没有套装效果启用
es_es: No hay bonos establecidos activados.

source: 燃烧！无法熄灭的火焰
es_es: ¡Incendio! ¡Llamas inextinguibles!

source: 状态异常，使用失败: {0}
es_es: Estado anormal, error de uso: {0}

source: 猪突猛进！
es_es: ¡Cargado!

source: 生命值上限 - {0}
es_es: Max HP - {0}

source: 生命值上限 + {0}
es_es: Max HP + {0}

source: 甲虫治疗 + {0} 治疗者:{1}
es_es: Curación del escarabajo + {0}. Sanador: {1}

source: 畸形怪脑发现了新鲜的脑子
es_es: ¡La Aberración ha encontrado un cerebro nuevo!

source: 疯狗狂叫！！！
es_es: Perro rabioso ladrando!!!

source: 看我一记耳光
es_es: ¡Toma esta bofetada!

source: 看我创死你
es_es: ¡Te voy a destrozar!

source: 神圣剑辉已启用
es_es: ¡Hoja Sagrada activada!

source: 离地牢远点！！！
es_es: Mantente alejado de la mazmorra !!!

source: 糊你一脸
es_es: ¡Te voy a dar una bofetada!

source: 罪恶血祭召唤远古守卫
es_es: ¡El Altar de Sangre convoca a un antiguo guardián!

source: 虚虚实实，实实虚虚
es_es: ¿Real o falso? ¡Quién sabe!

source: 蜂糖罐治疗 + {0}
es_es: Curación del tarro de miel + {0}

source: 血包治疗 + {0}
es_es: Curación del paquete de sangre + {0}

source: 被封印的骷髅帝王苏醒
es_es: ¡El Skeletron sellado despierta!

source: 诅咒开始应验
es_es: ¡Empieza la maldición!

source: 请在游戏里使用该指令
es_es: Por favor usa este comando en el juego.

source: 谁人惊扰了我的蜂巢！
es_es: ¿Quién se atreve a perturbar mi colmena?

source: 走位真菜
es_es: ¡Tu movimiento es tan malo!

source: 输入 /cenable 来启用挑战模式，再次使用取消
es_es: Escribe /cenable para habilitar el modo desafío, úsalo nuevamente para cancelar.

source: 输入 /cenable 来启用挑战模式，再次使用取消
es_es: Escribe /cenable para habilitar el modo desafío, úsalo nuevamente para cancelar.

source: 输入 /cf 来实现某些技能的或状态的切换
es_es: Escribe /cf para cambiar algunas habilidades o estados.

source: 输入 /ctip 来启用内容提示，如各种物品的强化文字提示，再次使用取消
es_es: Escriba /ctip para habilitar sugerencias de contenido, como sugerencias de texto mejorado para varios elementos, úselo nuevamente para cancelar.

source: 输入 /ctip 来启用内容提示，如各种物品装备的修改文字提示，再次使用取消
es_es: Escriba /ctip para habilitar sugerencias de contenido, como sugerencias de texto mejoradas para varios artículos y equipos, utilícelas nuevamente para cancelar.

source: 这么想看清我的卡姿兰大眼是吧
es_es: ¿Quieres ver mis ojos grandes?

source: 远方的巨兽将会摧毁你所拥有的一切
es_es: El gigante distante destruirá todo lo que tienes.

source: 连我都打不过，回家喝奶吧你
es_es: ¿Ni siquiera puedes vencerme? ¡Vete a casa y bebe tu leche!

source: 速度与激情
es_es: ¡Velocidad y pasión!

source: 邪恶的蠕虫寻找新的受害者
es_es: El malvado gusano busca una nueva víctima.

source: 闪避锁血成功！
es_es: ¡Esquiva y roba la vida del éxito!

source: 陨石回魔 + 3
es_es: Meteoritos Mana + 3

source: 魔力值上限 - {0}
es_es: Max Mana - {0}

source: 魔力值上限 + {0}
es_es: Max Mana + {0}
