namespace PvPer
{
    public static class DeathMessages
    {
        private static Random Random = new Random();
        public static string[] Messages = new string[] {
            "@0以为能胜过@1，结果却是舞到力竭！",
            "野生@1出现！@0瞬间倒下。",
            "@1轻轻一挥，@0飞得老远……哎呀，失误了！",
            "看来@0忘记低头躲避了，@1向他致意！",
            "智力对决中，@0在@1面前毫无防备。",
            "@1施放“ Abracadabra”，@0瞬间消失无踪。",
            "玫瑰红，紫罗兰蓝，@1打败了@0，好耶！",
            "@0妄想能在岩浆中游泳。剧透一下：他们做不到。@1玩得正欢呢！",
            "原来@1的剑比@0预料的还要饥饿。",
            "都说好奇害死猫，这次是@0，拜@1所赐。",
            "@0似乎低估了重力的力量。多亏了@1啊！",
            "常言道，复仇宜冷不宜热。@1却给@0端上了一盘热腾腾的“败局”！",
            "在PvP游戏中，要么赢，要么重生。对不起，@0，看来该复活了。",
            "@0挑战@1决斗。剧透：对@0来说，情况不太妙。",
            "哎呀！@0掉进了@1设下的陷阱……字面意义上的。",
            "据说自那次被@1击败后，@0至今还在寻找丢失的尊严。",
            "@1：1分，@0：0分。下次好运，@0！",
            "都说熟能生巧。看来@0还需多加练习才能对抗@1！",
            "在巨人间的碰撞中，@1战胜了@0，下次回合好运，@0！",
            "看起来@0被@1的毁灭之网困住了，这可真是个棘手的局面！",
            "连复活点都在@1击败@0后为他感到难过，可见有多惨。",
            "@0试图玩火，结果@1带着灭火器出现了。",
            "面对@1后，@0才意识到谨慎才是勇气的一部分。",
            "@1让@0的希望与梦想永远消逝。",
            "看样子@1刚刚解锁了成就：‘以风格击败@0’。",
            "若首次未成功，就重生再试吧，@0！",
            "常言道骄兵必败，@0在@1面前栽了个大跟头。",
            "哎呀！@0似乎没看清@1邀请决斗信上的小字。",
            "在智力较量中，@1手持火箭筒而来，而@0只带了根牙签。",
            "@1证明了在枪战中带刀是不明智的，对吧，@0？",
            "@0原以为自己有九条命，没想到@1更胜一筹。",
            "在传奇间的较量中，@1把@0远远甩在身后，@0下次重生时好运！",
            "最新消息：@1让@0重新考虑职业选择，从‘战士’变为‘靶子’。",
            "看来@0的守护天使在@1出现时请假了。",
            "至少@0能让@1在击败自己前笑得很开心，对吧？",
            "都说运气偏爱勇敢者，遗憾的是今天它站在了@1那边。",
            "在PvP史册上，这场对决将永远被铭记为‘@0 VS @1：一场大尴尬’。",
            "哎呀！@0似乎没看到@1大规模杀伤性武器上的警告标签。",
            "嗨，@0，给你个建议：下次当@1瞄准时，你得更快地躲闪！",
            "就这样，@1把@0变成了像素尘埃。",
            "看来@0的血量在@1加入战斗时下降得比铅球还快。",
            "还记得@0说他们是无敌的吗？好吧，@1刚改写了剧本。",
            "提醒自己：别在@1喝完早咖啡后再挑战他们进行PvP对决。",
            "在智力对决中，@1带来了棋盘，而@0带了跳棋盘。",
            "面对@1之后，@0的复活按钮从未如此诱人。",
            "突发新闻：@1不仅击溃了@0的精神，连他们的化身也一同摧毁。",
            "看起来@0不幸落入了@1激光聚焦的交叉火力中。",
            "好了，@0，也许你应该考虑在被@1击败后，将PvP策略从‘盲目冲锋’调整为‘战略性撤退’。",
            "都说实践出真知。那么，@0，你在与@1的实战中进展如何了呢？"
        };

        public static string GetMessage(string killer, string victim)
        {
            return Messages[Random.Next(Messages.Length)].Replace("@0", victim).Replace("@1", killer);
        }
    }
}